test/data/invoke-service.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:kron="http://kroniker.service.kihdb.silverbullet.dk/" xmlns:urn="urn:oio:medcom:chronic-dataset:1.0.0" xmlns:ns="http://rep.oio.dk/medcom.dk/xml/schemas/2011/06/20/">
    <soapenv:Header/>
    <soapenv:Body>
        <kron:UploadChronicDataset>
            <!--Optional:-->
            <urn:UploadChronicDatasetRequestMessage>
                <ns:MedComKD>
                    <ns:Borger>
                            <ns:CPR>2512484916</ns:CPR>
                            <ns:Fornavn>Nancy</ns:Fornavn>
                            <ns:Efternavn>Berggren</ns:Efternavn>
                            <ns:FoedselsDato>1948-12-25</ns:FoedselsDato>
                            <ns:Koen>K</ns:Koen>
                            <ns:Vej>Skovvejen 12</ns:Vej>
                            <ns:Postnummer>8010</ns:Postnummer>
                            <ns:By>Aarhus N</ns:By>
                            <ns:Kontakttelefon>86121824</ns:Kontakttelefon>
                            <ns:eMail>nb@meail.dk</ns:eMail>
                    </ns:Borger>
                </ns:MedComKD>
            </urn:UploadChronicDatasetRequestMessage>
        </kron:UploadChronicDataset>
    </soapenv:Body>
</soapenv:Envelope>